raceup-electric/stm32h5_template_drivers/adc.cpp
  const std::size_t begin = std::min(begin_sample, active_buffer_length);
  const std::size_t end = std::min(end_sample, active_buffer_length);
  auto* const buffer = dma_buffer(runtime);

  for (std::size_t sample = begin; sample < end; ++sample) {
    runtime.m_sum += buffer[sample];
    runtime.m_sample_count += 1U;
  }
}

void accumulate_dma_until(opaque_adc& runtime, const std::size_t boundary) noexcept {
  if (boundary <= runtime.m_processed_samples_in_cycle) {
    return;
  }

  accumulate_dma_samples(runtime, runtime.m_processed_samples_in_cycle, boundary);
  runtime.m_processed_samples_in_cycle = boundary;
}

uint64_t sum_fixed_dma_window(const opaque_adc& runtime,
                              const std::size_t end_sample) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto window_width = dma_window_width(runtime);
  auto* const buffer = dma_buffer(runtime);
  uint64_t sum{0U};

  const auto sum_range = [buffer, &sum](const std::size_t begin,
                                        const std::size_t end) noexcept {
    for (std::size_t sample = begin; sample < end; ++sample) {
      sum += buffer[sample];
    }
  };

  if (window_width <= end_sample) {
    sum_range(end_sample - window_width, end_sample);
    return sum;
  }

  const auto wrapped_count = window_width - end_sample;
  sum_range(active_buffer_length - wrapped_count, active_buffer_length);
  sum_range(0U, end_sample);
  return sum;
}

void complete_fixed_dma_window(opaque_adc& runtime,
                               const std::size_t boundary) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  if (active_buffer_length == 0U || boundary > active_buffer_length ||
      boundary <= runtime.m_processed_samples_in_cycle) {
    return;
  }

  const auto window_width = dma_window_width(runtime);
  const auto completed_count = boundary - runtime.m_processed_samples_in_cycle;
  const auto previous_valid_count = runtime.m_sample_count & DMA_SAMPLE_COUNT_MASK;
  const auto valid_count =
      std::min<uint32_t>(static_cast<uint32_t>(window_width),
                         previous_valid_count + static_cast<uint32_t>(completed_count));

  runtime.m_processed_samples_in_cycle = boundary;
  if (valid_count < window_width) {
    runtime.m_sample_count = valid_count;
    return;
  }

  runtime.m_sum = sum_fixed_dma_window(runtime, boundary);
  runtime.m_sample_count = static_cast<uint32_t>(window_width) | DMA_FIXED_WINDOW_READY;
}

bool prepare_dma_runtime(opaque_adc& runtime) noexcept {
  init_pin(runtime.port(), runtime.pin_init());
  runtime.m_sum = 0U;
  runtime.m_sample_count = 0U;
  runtime.m_processed_samples_in_cycle = 0U;
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto window_width = dma_window_width(runtime);
  return dma_buffer(runtime) != nullptr &&
         active_buffer_length <= dma_buffer_size_for(runtime.m_p_config) &&
         window_width > 0U && window_width <= active_buffer_length &&
         window_width <= DMA_SAMPLE_COUNT_MASK;
}

bool configure_adc_channel(opaque_adc& runtime) noexcept {
  auto channel_config = runtime.channel_init();
  channel_config.Rank = ADC_REGULAR_RANK_1;
  return HAL_ADC_ConfigChannel(&runtime.m_handle, &channel_config) == HAL_OK;
}

bool init_trigger_timer(opaque_adc& runtime) noexcept {
  enable_tim_clock(runtime.trigger_timer_instance());

  auto& timer_handle = runtime.m_trigger_timer_handle;
  timer_handle = {};
  timer_handle.Instance = runtime.trigger_timer_instance();
  timer_handle.Init = runtime.trigger_timer_init();
  timer_handle.Init.Prescaler =
      timer_prescaler(runtime.trigger_timer_instance(), runtime.trigger_counter_clock_hz());
  timer_handle.Init.Period =
      timer_period(runtime.trigger_counter_clock_hz(), runtime.trigger_frequency_hz());

  if (HAL_TIM_Base_Init(&timer_handle) != HAL_OK) {
    timer_handle.Instance = nullptr;
    return false;
  }

  auto master_config = runtime.trigger_master_config();
  if (HAL_TIMEx_MasterConfigSynchronization(&timer_handle, &master_config) != HAL_OK) {
    (void)HAL_TIM_Base_DeInit(&timer_handle);
    timer_handle.Instance = nullptr;
    return false;
  }

  __HAL_TIM_SET_COUNTER(&timer_handle, 0U);
  return true;
}

bool start_trigger_timer(opaque_adc& runtime) noexcept {
  auto& timer_handle = runtime.m_trigger_timer_handle;
  if (timer_handle.Instance == nullptr) {
    return true;
  }

  return HAL_TIM_Base_Start(&timer_handle) == HAL_OK;
}

bool start_dma_backend_impl(opaque_adc& runtime) noexcept {
  if (!runtime.uses_dma()) {
    return false;
  }

  auto* const active_owner = dma_owner_for_instance(runtime.instance());
  if (active_owner != nullptr && active_owner != &runtime) {
    return false;
  }

  if (dma_initialized(runtime)) {
    return true;
  }

  const auto* const config = runtime.m_p_config;
  runtime = make_opaque(config);
  set_dma_owner(runtime.instance(), &runtime);

  const auto fail = [&runtime, config]() noexcept {
    set_dma_owner(runtime.instance(), nullptr);
    runtime = make_opaque(config);
    return false;
  };

  __HAL_RCC_ADC_CLK_ENABLE();
  __HAL_RCC_GPDMA1_CLK_ENABLE();

  if (!prepare_dma_runtime(runtime)) {
    return fail();
  }

  if (runtime.uses_timer_trigger() && !init_trigger_timer(runtime)) {
    return fail();
  }

  DMA_NodeConfTypeDef node_config{};
  node_config.NodeType = DMA_GPDMA_LINEAR_NODE;
  node_config.Init.Request = runtime.dma_request();
  node_config.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
  node_config.Init.Direction = DMA_PERIPH_TO_MEMORY;
  node_config.Init.SrcInc = DMA_SINC_FIXED;
  node_config.Init.DestInc = DMA_DINC_INCREMENTED;
  node_config.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD;
  node_config.Init.DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD;
  node_config.Init.SrcBurstLength = 1U;
  node_config.Init.DestBurstLength = 1U;
  node_config.Init.TransferAllocatedPort =
      DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
  node_config.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  node_config.Init.Mode = DMA_NORMAL;
  node_config.TriggerConfig.TriggerPolarity = DMA_TRIG_POLARITY_MASKED;
  node_config.DataHandlingConfig.DataExchange = DMA_EXCHANGE_NONE;
  node_config.DataHandlingConfig.DataAlignment = DMA_DATA_RIGHTALIGN_ZEROPADDED;

