raceup-electric/stm32h5_template_drivers/adc.cpp
  if (HAL_DMAEx_List_BuildNode(&node_config, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_InsertNode(&runtime.m_dma_queue, nullptr, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_SetCircularMode(&runtime.m_dma_queue) != HAL_OK) {
    return fail();
  }

  runtime.m_dma_channel_handle.Instance = runtime.dma_channel();
  runtime.m_dma_channel_handle.InitLinkedList.Priority = DMA_LOW_PRIORITY_LOW_WEIGHT;
  runtime.m_dma_channel_handle.InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
  runtime.m_dma_channel_handle.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
  runtime.m_dma_channel_handle.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  runtime.m_dma_channel_handle.InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;

  if (HAL_DMAEx_List_Init(&runtime.m_dma_channel_handle) != HAL_OK ||
      HAL_DMAEx_List_LinkQ(&runtime.m_dma_channel_handle, &runtime.m_dma_queue) != HAL_OK ||
      HAL_DMA_ConfigChannelAttributes(&runtime.m_dma_channel_handle, DMA_CHANNEL_NPRIV) !=
          HAL_OK) {
    return fail();
  }

  HAL_NVIC_SetPriority(runtime.dma_irq(), 6U, 0U);
  HAL_NVIC_EnableIRQ(runtime.dma_irq());

  runtime.m_handle.Instance = runtime.instance();
  runtime.m_handle.Init = runtime.adc_init();
  __HAL_LINKDMA(&runtime.m_handle, DMA_Handle, runtime.m_dma_channel_handle);

  if (HAL_ADC_Init(&runtime.m_handle) != HAL_OK) {
    return fail();
  }

  if (!configure_adc_channel(runtime)) {
    return fail();
  }

  auto* const buffer = dma_buffer(runtime);
  std::fill_n(buffer, dma_transfer_length(runtime), 0U);

  if (HAL_ADCEx_Calibration_Start(&runtime.m_handle, ADC_SINGLE_ENDED) != HAL_OK ||
      HAL_ADC_Start_DMA(&runtime.m_handle,
                        reinterpret_cast<uint32_t*>(buffer),
                        static_cast<uint32_t>(dma_transfer_length(runtime))) != HAL_OK) {
    return fail();
  }

  if (!start_trigger_timer(runtime)) {
    return fail();
  }

  return true;
}

uint32_t lock_irq() noexcept {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  return primask;
}

void unlock_irq(const uint32_t primask) noexcept {
  __set_PRIMASK(primask);
}

expected::expected<uint16_t, result> read_dma_average(const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const uint32_t primask = lock_irq();
  const uint64_t sum = runtime->m_sum;
  const uint32_t count = runtime->m_sample_count;
  runtime->m_sum = 0U;
  runtime->m_sample_count = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return static_cast<uint16_t>(sum / count);
}

expected::expected<uint16_t, result> read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto window_width = dma_window_width(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = runtime->m_sum;
  const uint32_t count = runtime->m_sample_count;
  runtime->m_sample_count = count & DMA_SAMPLE_COUNT_MASK;
  unlock_irq(primask);

  if ((count & DMA_FIXED_WINDOW_READY) == 0U) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return static_cast<uint16_t>(sum / window_width);
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const uint32_t primask = lock_irq();
  const uint64_t sum = runtime->m_sum;
  const uint32_t count = runtime->m_sample_count;
  runtime->m_sum = 0U;
  runtime->m_sample_count = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{static_cast<uint16_t>(sum / count)};
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || runtime != &config) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto window_width = dma_window_width(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = runtime->m_sum;
  const uint32_t count = runtime->m_sample_count;
  runtime->m_sample_count = count & DMA_SAMPLE_COUNT_MASK;
  unlock_irq(primask);

  if ((count & DMA_FIXED_WINDOW_READY) == 0U) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{static_cast<uint16_t>(sum / window_width)};
}
}  // namespace

void adc_dma_half_transfer_callback(ADC_HandleTypeDef* hadc) noexcept {
  auto* const runtime = adc_from_handle(hadc);
  if (runtime == nullptr) {
    return;
  }

  const auto half_buffer_length = dma_transfer_length(*runtime) / 2U;
  if (uses_fixed_window_average(*runtime)) {
    complete_fixed_dma_window(*runtime, half_buffer_length);
  } else {
    accumulate_dma_until(*runtime, half_buffer_length);
  }
}

void adc_dma_full_transfer_callback(ADC_HandleTypeDef* hadc) noexcept {
  auto* const runtime = adc_from_handle(hadc);
  if (runtime == nullptr) {
    return;
  }

  if (uses_fixed_window_average(*runtime)) {
    complete_fixed_dma_window(*runtime, dma_transfer_length(*runtime));
  } else {
    accumulate_dma_until(*runtime, dma_transfer_length(*runtime));
  }
  runtime->m_processed_samples_in_cycle = 0U;
}

void adc_dma_irq_handler(ADC_TypeDef* const p_instance) noexcept {
  auto* const runtime = dma_owner_for_instance(p_instance);
  if (runtime == nullptr) {
    return;
  }

  HAL_DMA_IRQHandler(&runtime->m_dma_channel_handle);
}

bool opaque_adc::initialized() const noexcept {
  if (uses_dma()) {
    return running_dma_owner_for(*this) == this;
  }

